"use client";

import { Footer } from "@/component/footer";
import { Box, Container, Divider, Stack, Typography } from "@mui/material";
import Image from "next/image";

const FAQ = [
  {
    question: `Frontline Tracker คืออะไร และทำไมจึงมีความสำคัญ`,
    answer: `Frontline Tracker เป็นเครื่องมือช่วยเพิ่มประสิทธิภาพการทำงานของคุณ โดยให้การสนับสนุนด้านการพัฒนาทักษะและวิธีปฏิบัติส่วนบุคคลของคุณ เพื่อช่วยให้คุณขายรถได้มากขึ้นนั่นเอง 

Frontline Tracker มีเช็คลิสต์สิ่งสำคัญที่สุดที่คุณต้องทำทุกวัน และเมื่อคุณต้องการความกระจ่างหรือการสนับสนุนเพิ่มเติมเกี่ยวกับหัวข้อใดหัวข้อหนึ่ง และแจ้งให้เราทราบถึงความต้องการนั้นผ่านทางเช็คลิสต์ในทุก ๆ วัน เราจะสามารถจัดการอบรมหรือเนื้อหาเพิ่มเติมที่คุณต้องการได้ตรงจุด เพื่อคุณจะสามารถพัฒนาตนเองได้ต่อไปตามเป้าหมาย

สรุปแล้ว Frontline Tracker มีไว้เพื่อช่วยให้คุณเป็นนักขายที่ประสบความสำเร็จมากขึ้นนั่นเอง`,
  },
  {
    question: `มันทำงานอย่างไร และเกิดอะไรขึ้นกับข้อมูล`,
    answer: `คุณจะได้รับการฝึกอบรมระหว่างการเข้าร่วมเวิร์คช็อป เกี่ยวกับสิ่งสำคัญที่คุณต้องทำทุกวันในการทำงาน ซึ่งก็คือเช็คลิสต์ใน Frontline Tracker นั่นเอง

เมื่อคุณเริ่มนำสิ่งที่ได้เรียนรู้ไปปฏิบัติจริงในการทำงานและใช้กับลูกค้าแล้ว Frontline Tracker จะขอให้คุณตอบคำถามสำหรับแต่ละหัวข้อ โดยเลือกจากหนึ่งในสองคำตอบ คือ
      - "I've got it" ซึ่งหมายความว่า คุณได้ดำเนินการตามขั้นตอนอย่างมั่นใจและไม่ลังเล
      - “Deeper dive, please" ซึ่งหมายความว่า คุณยังไม่มั่นใจ 100% กับหัวข้อดังกล่าว และคุณต้องการเนื้อหาการฝึกอบรมเพิ่มเติมเพื่อช่วยคุณในเรื่องนี้

เมื่อเรามีข้อมูลดังกล่าวแล้ว เราจะจัดเตรียมเนื้อหาการฝึกอบรมที่คุณต้องการผ่าน virtual classroom ให้กับคุณ ง่าย ๆ เพียงเท่านี้เอง
`,
  },
  {
    question: `ทำไมฉันถึงต้องทำทุกวัน`,
    answer: `เช่นเดียวกับทุกอย่าง การฝึกฝนทำให้เกิดความสมบูรณ์แบบ!
นอกจากนี้ ก็เพื่อให้มั่นใจได้ว่าคุณจะได้รับเนื้อหาการฝึกอบรมที่คุณต้องการเท่านั้น ไม่เสียเวลาไปกับเนื้อหาที่คุณไม่ต้องการ

เมื่อเราเห็นจากข้อมูลว่าคุณมั่นใจในทุกการกระทำแล้ว คุณก็จะมีคุณสมบัติตรงตามมาตรฐาน RotF ซึ่งจะช่วยให้คุณกลายเป็นนักขายระดับแนวหน้า`,
  },
  {
    question: `กฎเกณฑ์ในการเข้าร่วมมีอะไรบ้าง`,
    answer: `คุณต้องใช้ Frontline Tracker ซึ่งเป็นส่วนหนึ่งของโปรแกรมการฝึกอบรม RotF

การเป็นนักขายที่ผ่านการรับรองคุณสมบัติ RotF เป็นข้อกำหนดสำหรับอนาคตของคุณในเมอร์เซเดส-เบนซ์

คุณต้องใช้ Frontline Tracker อย่างซื่อสัตย์ เพราะมันมีไว้เพื่อช่วยคุณเอง ไม่เช่นนั้นคุณก็จะเป็นฝ่ายเสียผลประโยชน์ ที่สำคัญที่สุด การใช้ Frontline Tracker และผ่านการพัฒนาทักษะและการปฏิบัติสำหรับตัวคุณเองนี้ก็เพื่อจะให้ผ่านคุณสมบัติ RotF ซึ่งเป็นข้อกำหนดสำหรับการเข้าร่วมงานมอเตอร์โชว์อีกด้วย`,
  },
  {
    question: `ฉันควรส่ง Frontline Tracker ตอนไหน`,
    answer: `คุณสามารถเข้าไปที่ลิงค์ ใส่คำตอบ แล้วทำการส่งเมื่อไดก็ได้เมื่อคุณสะดวก แต่ขอแนะนำว่าควรจะเป็นช่วงท้ายของวันที่ได้ผ่านการปฏิบัติงานหรือพบลูกค้าแล้ว แต่ถ้าเรายังไม่ได้รับข้อมูลจากคุณก่อนเวลาเลิกงาน ระบบจะส่งอีเมล์แจ้งเตือนพร้อมลิงค์ Frontline Tracker ให้คุณอีกครั้ง เพื่อให้มั่นใจว่าคุณจะไม่ลืมและสามารถเข้าไปกรอกข้อความได้โดยสะดวกรวดเร็ว`,
  },
  {
    question: `หากฉันมีข้อสงสัยที่นอกเหนือจากหัวข้อด้านบนต้องทำอย่างไร`,
    answer: `โปรดส่งคำถามหรือข้อเสนอแนะของคุณได้ที่ลิงค์ ‘ติดต่อสอบถาม’ ด้านล้าง ทีมงานของเราจะติดต่อกลับไปหาคุณโดยเร็วที่สุด`,
  },
];

export default function Page() {
  return (
    <>
      <Box
        width={"100%"}
        sx={{
          backgroundColor: "#E5E5E5",
          display: "flex",
          justifyContent: "center",
          height: { xs: "80px", lg: "120px" },
        }}
      >
        <div style={{ margin: "24px", position: "relative", width: "100%", height: "auto" }}>
          <Image
            src={"https://behavior-tracker-prach.s3.ap-southeast-1.amazonaws.com/logo.png"}
            alt="image"
            fill
            style={{ objectFit: "contain" }}
          />
        </div>
      </Box>
      <Container
        sx={{
          minHeight: { xs: "calc(100% - 200px)", lg: "calc(100% - 240px)" },
          padding: "32px 0px 32px 0px",
        }}
      >
        <Stack useFlexGap alignContent={"center"} spacing={4}>
          <Typography variant="h1" paddingX={2}>
            FAQ
          </Typography>
          <Stack alignContent={"center"} paddingX={2} spacing={1}>
            <Typography color={"primary"} variant="h2">
              คำถามที่พบบ่อย
            </Typography>
            <Typography variant="body2">คำตอบสำหรับคำถามที่พบบ่อยเกี่ยวกับ Frontline Tracker</Typography>
          </Stack>
          <Divider sx={{ borderWidth: "1px" }} />
          {FAQ.map((faq, index) => (
            <>
              <Stack key={faq.question} spacing={2} paddingX={2}>
                <Typography variant="h2" sx={{ whiteSpace: "pre-wrap" }}>
                  {faq.question}
                </Typography>
                <Typography variant="body2" sx={{ whiteSpace: "pre-wrap" }}>
                  {faq.answer}
                </Typography>
              </Stack>
              {index + 1 !== FAQ.length && <Divider sx={{ borderWidth: "1px" }} />}
            </>
          ))}
        </Stack>
      </Container>
      <Footer />
    </>
  );
}
